Revit 2027 API
BuiltInFailures.GroupFailures.DontEditNestedGroup Property
 Cannot edit nested Groups while inside Edit Group mode for its host Group. To edit the nested Group finish editing all Groups. Use the Tab key to select the nested Group and edit it directly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DontEditNestedGroup { get; }
Public Shared ReadOnly Property DontEditNestedGroup As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DontEditNestedGroup {
	FailureDefinitionId^ get ();
}
static member DontEditNestedGroup : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace